app/views/lists/index.html.erb

SELECT "items".* FROM "items" WHERE "items"."list_id" IN (27, 23)
---
      <ul>
        <% list.items.each do |item| %>