app/controllers/items_controller.rb

  def create

    @item = @list.items.new(content: "Novo item")

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("list_id", "content", "done") VALUES (3, 'Novo item', NULL) RETURNING "id"

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "content" = 'AAAAAAAAAAAAAAAAAAA' WHERE "items"."id" = 9

    def set_item
      # @item = Item.find(params.expect(:id))
      @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = 9 LIMIT 1

    def set_list
      @list = List.find(params[:list_id])  # Encontra a lista pela URL
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = 7 LIMIT 1