app/controllers/lists_controller.rb

SELECT "items".* FROM "items" WHERE "items"."list_id" IN (3, 5, 6, 7, 8, 4, 9, 10, 11, 12, 13)
SELECT "lists".* FROM "lists" INNER JOIN "user_lists" ON "lists"."id" = "user_lists"."list_id" WHERE "user_lists"."user_id" = 7
---
  def index
    @lists = current_user.lists.includes(:items)

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ('nova lista', '2025-01-13 20:30:44.663915', '2025-01-13 20:30:44.663915') RETURNING "id"
INSERT INTO "user_lists" ("user_id", "list_id") VALUES (5, 21) RETURNING "user_id", "list_id"
---
  def create
    # @list = List.new(name: "nova lista", user_id: current_user.id)
    # @list = current_user.lists.build(name: "nova lista")
    @list = List.new(name: "nova lista")

    respond_to do |format|
      if @list.save
        UserList.create(user: current_user, list: @list)

UPDATE "lists" SET "name" = 'lista da anaufms', "updated_at" = '2025-01-13 20:30:53.751910' WHERE "lists"."id" = 25
---
  def update
    respond_to do |format|
      if @list.update(list_params)

DELETE FROM "lists" WHERE "lists"."id" = 24
---
  def destroy
    @list.destroy!

SELECT "lists".* FROM "lists" INNER JOIN "user_lists" ON "lists"."id" = "user_lists"."list_id" WHERE "user_lists"."user_id" = 7 AND "lists"."id" = 24 LIMIT 1
---
  def correct_user
    @list = current_user.lists.find_by(id: params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = 24 LIMIT 1
---
    def set_list
      @list = List.find(params.expect(:id))